; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  ) 

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem_d1_r0_l5_p5_c5_g5)
  (:domain emergency-services)
  (:objects
    drone1 - drone
    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    food - content
    medicine - content
    left - arm
    right - arm
  )
  (:init
    (at-drone drone1 depot)
    (hand-empty drone1 left)
    (hand-empty drone1 right)
    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-person person1 loc1)
    (at-person person2 loc1)
    (at-person person3 loc4)
    (at-person person4 loc5)
    (at-person person5 loc5)
    (crate-content crate1 food)
    (crate-content crate2 food)
    (crate-content crate3 food)
    (crate-content crate4 medicine)
    (crate-content crate5 medicine)
  )
  (:goal (and
    (has-content person1 food)
    (has-content person2 food)
    (has-content person2 medicine)
    (has-content person3 medicine)
    (has-content person5 food)
  ))
)

; plan
1. (pick-up drone1 right crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate5)
   goals met: 0 of 5
2. (pick-up drone1 left crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate2)
   goals met: 0 of 5
3. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 0 of 5
4. (deliver drone1 right crate5 person2 loc1 medicine)
   deleted: (holding drone1 right crate5)
   added: (hand-empty drone1 right) (has-content person2 medicine)
   goals met: 1 of 5
5. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 1 of 5
6. (pick-up drone1 right crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate4)
   goals met: 1 of 5
7. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 1 of 5
8. (deliver drone1 right crate4 person3 loc4 medicine)
   deleted: (holding drone1 right crate4)
   added: (hand-empty drone1 right) (has-content person3 medicine)
   goals met: 2 of 5
9. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 2 of 5
10. (pick-up drone1 right crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate3)
   goals met: 2 of 5
11. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 2 of 5
12. (deliver drone1 right crate3 person5 loc5 food)
   deleted: (holding drone1 right crate3)
   added: (hand-empty drone1 right) (has-content person5 food)
   goals met: 3 of 5
13. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 3 of 5
14. (pick-up drone1 right crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate1)
   goals met: 3 of 5
15. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 3 of 5
16. (deliver drone1 right crate1 person2 loc1 food)
   deleted: (holding drone1 right crate1)
   added: (hand-empty drone1 right) (has-content person2 food)
   goals met: 4 of 5
17. (deliver drone1 left crate2 person1 loc1 food)
   deleted: (holding drone1 left crate2)
   added: (hand-empty drone1 left) (has-content person1 food)
   goals met: 5 of 5
